.emacs.d/Emacs.org
#+title: Emacs configuration
#+author: Philippe Gabriel

Below is a sectioned configuration of emacs. Each code blocks gets written out to the ~~/.emacs.d/init.el~ config file.

* Startup

** Performance Measurements

Here we reduce threshold for garbage collector to improve performanceand check for the startup time.

#+begin_src emacs-lisp :tangle ~/.emacs.d/init.el
  
  (setq gc-cons-threshold (* 50 1000 1000)) ; Sets garbage collection threshold high enough

#+end_src

** Server Initialization

Starting a server for displaying polybar info

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-startup.el

  (server-start)

#+end_src

** Package Initialization

Some initializations are first set up.

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-startup.el

  (unless (featurep 'straight)
    (defvar bootstrap-version)
    (let ((bootstrap-file
	   (expand-file-name "straight/repos/straight.el/bootstrap.el" user-emacs-directory))
	  (bootstrap-version 5))
      (unless (file-exists-p bootstrap-file)
	(with-current-buffer
	    (url-retrieve-synchronously
	     "https://raw.githubusercontent.com/raxod502/straight.el/develop/install.el"
	     'silent 'inhibit-cookies)
	  (goto-char (point-max))
	  (eval-print-last-sexp)))
      (load bootstrap-file nil 'nomessage)))

#+end_src

** Startup package

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-startup.el

  (provide 'pg-startup)

#+end_src

* Native Compilation

** Native compilation settings

Some settings specific to the ~emacs-native-comp~ version of emacs

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-native-compilation.el

  (setq native-comp-async-report-warnings-errors nil) ; Silence compiler warnings
  (add-to-list 'native-comp-eln-load-path (expand-file-name "eln-cache/" user-emacs-directory)) ; Set directory for cache storage

#+end_src

** Native compilation package

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-native-compilation.el

  (provide 'pg-native-compilation)

#+end_src

* Packages

** Guix Management

*** Package | guix

Emacs interface for guix package manager.

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-guix.el

  (unless (fboundp 'guix)
    (autoload #'guix "guix" nil t))

#+end_src

*Guix Packages*

#+begin_src scheme :noweb-ref packages :noweb-sep ""

  "emacs-guix"

#+end_src

*** Package | geiser

Scheme REPL.

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-guix.el

  (unless (fboundp 'run-geiser)
    (autoload #'run-geiser "geiser-repl" nil t))
  (with-eval-after-load 'geiser-repl
    (define-key geiser-repl-mode-map "C-l" #'geiser-repl-clear-buffer))

#+end_src

*** System management package

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-guix.el

  (provide 'pg-guix)

#+end_src

** Password Utilities

*** Package | auth-source

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-passwords.el

  (require 'auth-source)
  (with-eval-after-load 'auth-source
    (customize-set-variable 'auth-sources '("~/.authinfo.gpg")))

#+end_src

*** Package | pinentry

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-passwords.el

  (unless pg/is-termux
    (straight-use-package 'pinentry)
    (require 'epg-config)
    (require 'pinentry)
    (with-eval-after-load 'epg-config
      (customize-set-variable 'epg-pinentry-mode 'loopback))
    (with-eval-after-load 'pinentry
      (pinentry-start)))

#+end_src

*Guix Packages*

#+begin_src scheme :noweb-ref packages :noweb-sep ""

  ;; "emacs-pinentry"
  "pinentry-emacs"

#+end_src

*** Package | password-cache

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-passwords.el

  (require 'password-cache)
  (with-eval-after-load 'password-cache
    (customize-set-variable 'password-cache-expiry (* 60 60 2)))

#+end_src

*** Package | password-store

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-passwords.el

  (straight-use-package 'password-store)
  (require 'password-store)
  (with-eval-after-load 'password-store
    (customize-set-variable 'password-store-time-before-clipboard-restore 60))

#+end_src

#+begin_src scheme :noweb-ref packages :noweb-sep ""

  ;; "emacs-password-store"

#+end_src

*** Password lookup

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-passwords.el

  (defun pg/lookup-password (&rest keys)
    "Looks up passwords from `authinfo' entries."
    (let ((result (apply #'auth-source-search keys)))
      (if result
          (funcall (plist-get (car result) :secret))
        nil)))

#+end_src

*** Password utilities package

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-passwords.el

  (provide 'pg-passwords)

#+end_src

** Keybind Log

*** Package | keycast

Useful when starting out with the various keybindings and when presenting to an audience.

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-keylog.el

  (define-minor-mode pg/keycast-mode
    "Show current command and its key binding in the mode line (fix for use with
      doom-mode-line)."
    :global t
    (interactive)
    (if pg/keycast-mode
        (add-hook 'pre-command-hook #'keycast--update t)
      (remove-hook 'pre-command-hook #'keycast--update)))

  (straight-use-package 'keycast)
  (require 'keycast)
  (with-eval-after-load 'keycast
    (customize-set-variable 'keycast-mode-line-format "%2s%k%c%2s")
    (fset #'keycast-mode #'pg/keycast-mode)
    (keycast-mode)
    (add-to-list 'global-mode-string '("" keycast-mode-line)))

#+end_src

*Guix Packages*

#+begin_src scheme :noweb-ref packages :noweb-sep ""

  ;; "emacs-keycast"

#+end_src

*** Keybind Log package

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-keylog.el

  (provide 'pg-keylog)

#+end_src

** Command Completion Framework

*** Package | savehist

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-completion.el

  (require 'savehist)
  (with-eval-after-load 'savehist
    (savehist-mode))

#+end_src

*** Package | marginalia

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-completion.el

  (straight-use-package 'marginalia)
  (with-eval-after-load 'vertico
    (require 'marginalia)
    (with-eval-after-load 'marginalia
      (customize-set-variable 'marginalia-annotators '(marginalia-annotators-heavy
                                                       marginalia-annotators-light
                                                       nil))
      (marginalia-mode)))

#+end_src

*Guix Packages*

#+begin_src scheme :noweb-ref packages :noweb-sep ""

  ;; "emacs-marginalia"

#+end_src

*** Package | consult

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-completion.el

  (straight-use-package 'consult)
  (require 'consult)
  (with-eval-after-load 'consult
    (global-set-key (kbd "C-s") #'consult-line)
    (global-set-key (kbd "C-x b") #'consult-buffer)
    (define-key minibuffer-local-map (kbd "C-r") #'consult-history))

#+end_src

*Guix Packages*

#+begin_src scheme :noweb-ref packages :noweb-sep ""

  ;; "emacs-consult"

#+end_src

*** Package | orderless

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-completion.el

  (straight-use-package 'orderless)
  (with-eval-after-load 'vertico
    (require 'orderless)
    (with-eval-after-load 'orderless
      (customize-set-variable 'completion-styles '(orderless))
      (customize-set-variable 'completion-category-defaults nil)
      (customize-set-variable 'orderless-skip-highlighting nil)
      (customize-set-variable 'completion-category-overrides '((file (styles basic partial-completion))))))

#+end_src

*Guix Packages*

#+begin_src scheme :noweb-ref packages :noweb-sep ""

  ;; "emacs-orderless"

#+end_src

*** Package | corfu

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-completion.el

  (straight-use-package 'corfu)
  (require 'corfu)
  (with-eval-after-load 'corfu
    (define-key corfu-map (kbd "C-j") #'corfu-next)
    (define-key corfu-map (kbd "C-k") #'corfu-previous)
    (customize-set-variable 'corfu-cycle t))

#+end_src

*Guix Packages*

#+begin_src scheme :noweb-ref packages :noweb-sep ""

  ;; "emacs-corfu"

#+end_src

*** Package | vertico

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-completion.el

  (straight-use-package 'vertico)
  (require 'vertico)
  (with-eval-after-load 'vertico
    (define-key vertico-map (kbd "C-j") #'vertico-next)
    (define-key vertico-map (kbd "C-k") #'vertico-previous)
    (customize-set-variable 'vertico-cycle t)
    (vertico-mode))

#+end_src

*Guix Packages*

#+begin_src scheme :noweb-ref packages :noweb-sep ""

  ;; "emacs-vertico"

#+end_src

*** Package | embark

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-completion.el

  (straight-use-package 'embark)
  (require 'embark)
  (with-eval-after-load 'embark
    (global-set-key (kbd "C-S-a") #'embark-act)
    (define-key minibuffer-local-map (kbd "C-d") #'embark-act)
    (customize-set-variable 'embark-confirm-act-all nil)
    (setq embark-action-indicator
          (lambda (map)
            (which-key--show-keymap "Embark" map nil nil 'no-paging)
            #'which-key--hide-popup-ignore-command)
          embark-become-indicator embark-action-indicator))

#+end_src

*Guix Packages*

#+begin_src scheme :noweb-ref packages :noweb-sep ""

  ;; "emacs-embark"

#+end_src

*** Package | embark-consult

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-completion.el

  (straight-use-package '(embark-consult :host github
                                         :repo "oantolin/embark"
                                         :files ("embark-consult.el")))
  (require 'embark-consult)
  (with-eval-after-load 'embark
    (with-eval-after-load 'consult
      (add-hook 'embark-collect-mode-hook #'consult-preview-at-point-mode)))

#+end_src

*** Package | prescient

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-completion.el

  (straight-use-package 'prescient)
  (require 'prescient)

#+end_src

*Guix Packages*

#+begin_src scheme :noweb-ref packages :noweb-sep ""

  ;; "emacs-prescient"

#+end_src

*** Package | which-key

Displays additional keybindings subsequent to prefix keybindings

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-completion.el

  (straight-use-package 'which-key)
  (require 'which-key)
  (with-eval-after-load 'which-key
    (which-key-mode)
    (customize-set-variable 'which-key-idle-delay 1)
    (diminish 'which-key-mode))

#+end_src

*Guix Packages*

#+begin_src scheme :noweb-ref packages :noweb-sep ""

  ;; "emacs-which-key"

#+end_src

*** Package | helm

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-completion.el

  (straight-use-package 'helm)
  (with-eval-after-load 'lsp-java
    (require 'helm)
    (with-eval-after-load 'helm
      (define-key helm-map (kbd "C-j") #'helm-next-line)
      (define-key helm-map (kbd "C-k") #'helm-previous-line)
      (if (and (eq #'java-mode major-mode) (memq #'lsp-mode local-minor-modes))
          (helm-mode 1)
        (helm-mode 0))))

#+end_src

*Guix Packages*

#+begin_src scheme :noweb-ref packages :noweb-sep ""

  ;; "emacs-helm"

#+end_src

*** Command completion framework package

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-completion.el

  (provide 'pg-completion)

#+end_src

** UI Enhancement

