.emacs.d/Emacs.org
*** UI basic settings

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-ui.el

  (setq inhibit-startup-message t  ; Disable startup message
        scroll-conservatively 1000 ; Slow scrolling
        split-width-threshold 185) ; Width for splitting
  (unless pg/is-termux
    (scroll-bar-mode 0)            ; Disable visible scrollbar
    (tool-bar-mode 0)              ; Disable toolbar
    (tooltip-mode 0))
  (menu-bar-mode 0)                ; Disable menu bar

  ;; Set frame transparency
  (unless (or pg/is-termux (not pg/exwm-enabled))
    (set-frame-parameter (selected-frame) 'alpha '(90 . 90))
    (add-to-list 'default-frame-alist '(alpha . (90 . 90)))
    (set-frame-parameter (selected-frame) 'fullscreen 'maximized)
    (add-to-list 'default-frame-alist '(fullscreen . maximized)))

#+end_src

*** Package | diminish

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-ui.el

  (straight-use-package 'diminish)
  (require 'diminish)

#+end_src

*Guix Packages*

#+begin_src scheme :noweb-ref packages :noweb-sep ""

  ;; "emacs-diminish"

#+end_src

*** Package | all-the-icons

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-ui.el

  (straight-use-package 'all-the-icons)
  (require 'all-the-icons)

#+end_src

*Guix Packages*

#+begin_src scheme :noweb-ref packages :noweb-sep ""

  ;; "emacs-all-the-icons"

#+end_src

*** Package | doom-modeline

Customizes the look of the modeline for better aesthetic.

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-ui.el

  (straight-use-package 'doom-modeline)
  (require 'doom-modeline)
  (with-eval-after-load 'doom-modeline
    (doom-modeline-mode 1)
    (customize-set-variable 'doom-modeline-height 15)
    (customize-set-variable 'doom-modeline-modal-icon nil)
    (customize-set-variable 'doom-modeline-enable-word-count t)
    (customize-set-variable 'doom-modeline-indent-info t)
    (customize-set-variable 'doom-modeline-buffer-file-name-style 'truncate-except-project)
    (customize-set-variable 'doom-modeline-mu4e t))

#+end_src

*Guix Packages*

#+begin_src scheme :noweb-ref packages :noweb-sep ""

  ;; "emacs-doom-modeline"

#+end_src

*** Package | autothemer

Important to disable current theme ~M-x disable-theme~ in order to experiment.

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-ui.el

  (straight-use-package 'autothemer)
  (require 'autothemer)
  (with-eval-after-load 'autothemer
    (load-theme 'onedark-variant t))

#+end_src

*Guix Packages*

#+begin_src scheme :noweb-ref packages :noweb-sep ""

  ;; "emacs-autothemer"

#+end_src

*** Package | dashboard

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-ui.el

  (defun pg/dashboard-setup-startup-hook ()
    "Setup post initialization hooks."
    (add-hook 'after-init-hook #'(lambda ()
				 ;; Display useful lists of items
				 (dashboard-insert-startupify-lists)))
    (add-hook 'emacs-startup-hook #'(lambda ()
				    (switch-to-buffer dashboard-buffer-name)
				    (goto-char (point-min))
				    (redisplay)
				    (run-hooks 'dashboard-after-initialize-hook))))

  (defun pg/display-startup-time ()
    "Displays some startip statistics."
    (let ((package-count 0) (time (float-time (time-subtract after-init-time before-init-time))))
      (when (boundp 'straight--profile-cache)
	(setq package-count (+ (hash-table-count straight--profile-cache) package-count)))
      (if (zerop package-count)
	  (format "Emacs started in %.2f" time)
	(format "%d packages loaded in %.2f seconds with %d garbage collections" package-count time gcs-done))))

  (straight-use-package 'dashboard)
  (with-eval-after-load 'projectile
    (require 'dashboard)
    (with-eval-after-load 'dashboard
      (customize-set-variable 'dashboard-set-file-icons t)
      (customize-set-variable 'dashboard-items '((recents . 10)
						 (projects . 10)
						 (agenda . 5)))
      (customize-set-variable 'dashboard-page-separator "\n\f\n")
      (customize-set-variable 'dashboard-init-info #'pg/display-startup-time)
      (fset #'dashboard-setup-startup-hook #'pg/dashboard-setup-startup-hook)
      (pg/dashboard-setup-startup-hook)))

#+end_src

*Guix Packages*

#+begin_src scheme :noweb-ref packages :noweb-sep ""

  ;; "emacs-dashboard" ;; old version 1.7.0, need 1.8.0

#+end_src

*** Package | page-break-lines

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-ui.el

  (straight-use-package 'page-break-lines)
  (require 'page-break-lines)

#+end_src

*Guix Packages*

#+begin_src scheme :noweb-ref packages :noweb-sep ""

  ;; "emacs-page-break-lines"

#+end_src

*** UI enhancement package

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-ui.el

  (provide 'pg-ui)

#+end_src

** Window Management

*** Window basic management

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-buffer.el

  (setq even-window-sizes nil
        display-buffer-base-action
        '(display-buffer-reuse-mode-window
          display-buffer-reuse-window
          display-buffer-same-window))

#+end_src

*** Package | bufler

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-buffer.el

  (straight-use-package 'bufler)
  (unless (fboundp 'bufler)
    (autoload #'bufler "bufler" nil t))
  (with-eval-after-load 'evil-collection
    (with-eval-after-load 'bufler
      (evil-collection-define-key 'normal 'bufler-list-mode-map
        (kbd "RET")   'bufler-list-buffer-switch
        (kbd "M-RET") 'bufler-list-buffer-peek
        "D"           'bufler-list-buffer-kill)
      (global-set-key (kbd "C-x C-b") #'bufler)
      (setf bufler-groups
            (bufler-defgroups

              ;; Subgroup collecting all named workspaces.
              (group (auto-workspace))

              ;; Subgroup collecting buffers in a projectile project.
              (group (auto-projectile))

              ;; Grouping browser windows
              (group
               (group-or "Browsers"
                         (name-match "Firefox" (rx bos "firefox"))))

              (group
               (group-or "Chat"
                         (name-match "Discord" (rx bos "discord"))
                         (mode-match "Slack" (rx bos "slack-"))))

              (group
               ;; Subgroup collecting all `help-mode' and `info-mode' buffers.
               (group-or "Help/Info"
                         (mode-match "*Help*" (rx bos (or "help-" "helpful-")))
                         (mode-match "*Info*" (rx bos "info-"))))

              (group
               ;; Subgroup collecting all special buffers (i.e. ones that are not
               ;; file-backed), except `magit-status-mode' buffers (which are allowed to fall
               ;; through to other groups, so they end up grouped with their project buffers).
               (group-and "*Special*"
                          (name-match "**Special**"
                                      (rx bos "*" (or "Messages" "Warnings" "scratch" "Backtrace" "Pinentry") "*"))
                          (lambda (buffer)
                            (unless (or (funcall (mode-match "Magit" (rx bos "magit-status"))
                                                 buffer)
                                        (funcall (mode-match "Dired" (rx bos "dired"))
                                                 buffer)
                                        (funcall (auto-file) buffer))
                              "*Special*"))))

              ;; Group remaining buffers by major mode.
              (auto-mode)))))

#+end_src

*** Package | winner-mode

For window configurations

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-buffer.el

  (require 'winner)
  (with-eval-after-load 'winner
    (winner-mode))

#+end_src

*** Package | tab-bar

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-buffer.el

  (require 'tab-bar)
  (with-eval-after-load 'tab-bar
    (customize-set-variable 'tab-bar-show 1)
    (tab-bar-mode))

#+end_src

*** Package | perspective

For organizing the buffer list

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-buffer.el

  (straight-use-package 'perspective)
  (require 'perspective)
  (with-eval-after-load 'perspective
    (global-set-key (kbd "C-x k") #'persp-kill-buffer*)
    (customize-set-variable 'persp-suppress-no-prefix-key-warning t)
    (unless (equal persp-mode t) (persp-mode)))

#+end_src

*Guix Packages*

#+begin_src scheme :noweb-ref packages :noweb-sep ""

  ;; "emacs-perspective"

#+end_src

*** Window management package

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-buffer.el

  (provide 'pg-buffer)

#+end_src

** Email Management

*** Email configuration file

After having setup the file, make sure to run the following commands:
- ~mu init --maildir=~/Mail --my-address=address1@domain1.com --my-address=address2@domain2.com ...~ - For all different addresses
- ~mu index~ - To index the given addresses

#+begin_src conf :tangle ~/.mbsyncrc

  # Main hotmail account
  IMAPAccount hotmail
  Host outlook.office365.com
  User pgabriel999@hotmail.com
  Port 993
  PassCmd "emacsclient -e \"(pg/lookup-password :host \\\"hotmail.com\\\" :user \\\"pgabriel999\\\")\" | cut -d '\"' -f2"
  SSLType IMAPS
  CertificateFile /etc/ssl/certs/ca-certificates.crt

  IMAPStore hotmail-remote
  Account hotmail

  MaildirStore hotmail-local
  Subfolders Verbatim
  Path /home/phil-gab99/Mail/Main/
  Inbox /home/phil-gab99/Mail/Main/Inbox

  Channel hotmail
  Far :hotmail-remote:
  Near :hotmail-local:
  Patterns *
  CopyArrivalDate yes
  Create Both
  Expunge Both
  SyncState *

  # University account
  IMAPAccount umontreal
  Host outlook.office365.com
  User philippe.gabriel.1@umontreal.ca
  Port 993
  PassCmd "emacsclient -e \"(pg/lookup-password :host \\\"umontreal.ca\\\" :user \\\"philippe.gabriel.1\\\")\" | cut -d '\"' -f2"
  SSLType IMAPS
  AuthMechs PLAIN
  CertificateFile /etc/ssl/certs/ca-certificates.crt

  IMAPStore umontreal-remote
  Account umontreal

  MaildirStore umontreal-local
  SubFolders Verbatim
  Path /home/phil-gab99/Mail/University/
  Inbox /home/phil-gab99/Mail/University/Inbox

  Channel umontreal
  Far :umontreal-remote:
  Near :umontreal-local:
  Patterns *
  CopyArrivalDate yes
  Create Both
  Expunge Both
  SyncState *

#+end_src

*Guix Packages*

#+begin_src scheme :noweb-ref packages :noweb-sep ""

  "mu"
  "isync"
  "oauth2ms"

#+end_src

