.emacs.d/Emacs.org
*** Package | visual-fill-column

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-help.el

  (defun pg/docs-visual-fill ()
    "Applies text soft wrap."
    (setq visual-fill-column-width 150
          visual-fill-column-center-text t)
    (visual-fill-column-mode 1))

  (straight-use-package 'visual-fill-column)
  (require 'visual-fill-column)
  (with-eval-after-load 'visual-fill-column
    (dolist (mode '(org-mode-hook
                    gfm-view-mode-hook
                    Info-mode-hook
                    eww-mode-hook))
      (add-hook mode #'pg/docs-visual-fill)))

#+end_src

*Guix Packages*

#+begin_src scheme :noweb-ref packages :noweb-sep ""

  ;; "emacs-visual-fill-column"

#+end_src

*** Help documentation package

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-help.el

  (provide 'pg-help)

#+end_src

** Web Design

*** Package | eww

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-web.el

  (defun pg/eww-mode-setup ()
    (auto-fill-mode 0)
    (visual-line-mode 1)
    (setq-local face-remapping-alist '((variable-pitch (:height 2.0) variable-pitch)
                                       (fixed-pitch (:height 2.0) fixed-pitch)
                                       (default (:height 2.0) default))))

  (require 'eww)
  (with-eval-after-load 'eww
    (add-hook 'eww-mode-hook #'pg/eww-mode-setup))

#+end_src

*** Web design package

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-web.el

  (provide 'pg-web)

#+end_src

** File management

*** Temporary Files Management and Symlinks

Some settings to manage where emacs stores backup files (such as the =~= backup files).

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-file.el

  (setq backup-directory-alist `(("." . ,(expand-file-name "tmp/backups/" user-emacs-directory)))
        auto-save-list-file-prefix (expand-file-name "tmp/auto-saves/sessions/" user-emacs-directory)
        auto-save-file-name-transforms `((".*" ,(expand-file-name "tmp/auto-saves/" user-emacs-directory) t))
        vc-follow-symlinks t)

#+end_src

*** Package | dired

The built-in directory editor. Some basic useful keybindings to keep in mind:
- ~j~ / ~k~ - Next / Previous line
- ~J~ - Jump to file in buffer
- ~RET~ - Select file or directory
- ~^~ - Go to parent directory
- ~g O~ - Open file in other window
- ~g o~ - Open file in other window in preview mode, which can be closed with ~q~
- ~M-RET~ - Show file in other window without focusing (previewing)

Keybindings relative to marking (selecting) in dired:
- ~m~ - Marks a file
- ~u~ - Unmarks a file
- ~U~ - Unmarks all files in buffer
- ~t~ - Inverts marked files in buffer
- ~% m~ - Mark files in buffer using regular expression
- ~*~ - Lots of other auto-marking functions
- ~K~ - "Kill" marked items, removed from the view only (refresh buffer with ~g r~ to get them back)
Many operations can be done on a single file if there are no active marks.

Keybindings relative to copying and renaming files:
- ~C~ - Copy marked files (or if no files are marked, the current file)
- ~R~ - Rename marked files
- ~% R~ - Rename based on regular expression

Keybindings relative to deleting files:
- ~D~ - Delete marked file
- ~d~ - Mark file for deletion
- ~x~ - Execute deletion for marks
- ~delete-by-moving-to-trash~ - Move to trash instead of deleting permanently if set to true

Keybindings relative to archives and compressing:
- ~Z~ - Compress or uncompress a file or folder to (.tar.gz)
- ~c~ - Compress selection to a specific file
- ~dired-compress-files-alist~ - Bind compression commands to file extension by adding additional extensions to the list

Keybindings for other useful operations:
- ~T~ - Touch (change timestamp)
- ~M~ - Change file mode
- ~O~ - Change file owner
- ~G~ - Change file group
- ~S~ - Create a symbolic link to this file
- ~L~ - Load an Emacs Lisp file into Emacs
  
#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-file.el

  (unless (fboundp 'dired-jump)
    (autoload #'dired-jump "dired" nil t))
  (unless (fboundp 'dired)
    (autoload #'dired "dired" nil t))
  (with-eval-after-load 'dired
    (global-set-key (kbd "C-x C-j") #'dired-jump)
    (evil-collection-define-key 'normal 'dired-mode-map "h" 'dired-single-up-directory "l" 'dired-single-buffer)
    (customize-set-variable 'dired-listing-switches "-agho --group-directories-first"))

#+end_src

*** Package | dired-single

Keeps a single dired buffer open at a time (to not have multiple buried buffers).

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-file.el

  (straight-use-package 'dired-single)
  (with-eval-after-load 'dired
    (require 'dired-single))

#+end_src

*** Package | all-the-icons-dired

Displays icons in dired-mode.

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-file.el

  (straight-use-package 'all-the-icons-dired)
  (unless pg/is-termux
    (require 'all-the-icons-dired)
    (with-eval-after-load 'all-the-icons-dired
      (add-hook 'dired-mode-hook #'all-the-icons-dired-mode)))

#+end_src

*Guix Packages*

#+begin_src scheme :noweb-ref packages :noweb-sep ""

  ;; "emacs-all-the-icons-dired"

#+end_src

*** Package | dired-hide-dotfiles

Togglable option for hiding dot files.

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-file.el

  (straight-use-package 'dired-hide-dotfiles)
  (with-eval-after-load 'evil-collection
    (unless (fboundp 'dired-hide-dotfiles-mode)
      (autoload #'dired-hide-dotfiles-mode "dired-hide-dotfiles" nil t))
    (with-eval-after-load 'dired-hide-dotfiles
      (add-hook 'dired-mode-hook #'dired-hide-dotfiles-mode)
      (evil-collection-define-key 'normal 'dired-mode-map "H" 'dired-hide-dotfiles-mode)))

#+end_src

*** Package | openwith

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-file.el

  (straight-use-package 'openwith)
  (unless pg/is-termux
    (require 'openwith)
    (with-eval-after-load 'openwith
      (customize-set-variable 'large-file-warning-threshold nil)
      (customize-set-variable 'openwith-associations
                              `((,(openwith-make-extension-regexp '("mpg" "mpeg" "mp4" "avi" "wmv" "mov" "flv" "ogm" "ogg" "mkv"))
                                 "mpv"
                                 (file))
                                (,(openwith-make-extension-regexp '("odt"))
                                 "libreoffice"
                                 (file))))
      (openwith-mode 1)))

#+end_src

*Guix Packages*

#+begin_src scheme :noweb-ref packages :noweb-sep ""

  ;; "emacs-openwith"

#+end_src

*** File management package

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-file.el

  (provide 'pg-file)

#+end_src

** Shell customization

*** Package | eshell-git-prompt

Adds more detail to the prompt in eshell with custome themes.

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-shell.el

  (straight-use-package 'eshell-git-prompt)
  (with-eval-after-load 'eshell
    (require 'eshell-git-prompt)
    (with-eval-after-load 'eshell-git-prompt
      (eshell-git-prompt-use-theme 'multiline2)))

#+end_src

*** Package | eshell-syntax-highlighting

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-shell.el

  (straight-use-package 'eshell-syntax-highlighting)
  (with-eval-after-load 'eshell
    (require 'eshell-syntax-highlighting)
    (with-eval-after-load 'eshell-syntax-highlighting
      (eshell-syntax-highlighting-global-mode t)))

#+end_src

#+begin_src scheme :noweb-ref packages :noweb-sep ""

  ;; "emacs-eshell-syntax-highlighting"

#+end_src

*** Package | esh-autosuggest

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-shell.el

  (defun pg/esh-autosuggest-setup ()
    "Eshell autosuggest setup."
    (require 'company)
    (set-face-foreground 'company-preview-common nil)
    (set-face-background 'company-preview nil))

  (straight-use-package 'esh-autosuggest)
  (with-eval-after-load 'eshell
    (require 'esh-autosuggest)
    (with-eval-after-load 'esh-autosuggest
      (add-hook 'eshell-mode-hook #'esh-autosuggest-mode)
      (customize-set-variable 'esh-autosuggest-delay 0.5)
      (pg/esh-autosuggest-setup)))

#+end_src

#+begin_src scheme :noweb-ref packages :noweb-sep ""

  ;; "emacs-esh-autosuggest"

#+end_src

*** Package | eshell

Some configurations to the built-in eshell.

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-shell.el

  (defun pg/configure-eshell ()
    "Eshell setup."
    ;; Save command history when commands are entered
    (add-hook 'eshell-pre-command-hook #'eshell-save-some-history)

    ;; Truncate buffer for performance
    (add-to-list 'eshell-output-filter-functions 'eshell-truncate-buffer)

    ;; Bind some useful keys for evil-mode
    (evil-define-key '(normal insert visual) eshell-mode-map (kbd "<home>") 'eshell-bol)
    (evil-normalize-keymaps)

    (corfu-mode)

    (setq eshell-history-size 10000
          eshell-buffer-maximum-lines 10000
          eshell-hist-ignoredups t
          eshell-scroll-to-bottom-on-input t))

  (require 'eshell)
  (with-eval-after-load 'eshell
    (require 'em-tramp)
    (add-hook 'eshell-first-time-mode-hook #'pg/configure-eshell)
    (customize-set-variable 'eshell-prefer-lisp-functions t))

#+end_src

*** Package | vterm

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-shell.el

  (require 'vterm)

#+end_src

*Guix Packages*

#+begin_src scheme :noweb-ref packages :noweb-sep ""

  "emacs-vterm"

#+end_src

*** Shell customization package

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-shell.el

  (provide 'pg-shell)

#+end_src

** Project Management and Version Control

*** Package | projectile

Allows for git projects management. Accessed using the ~C-c p~ prefix. Some important notes:
- ~C-c p E~ - Allows creation of a local dirs dot file for pre-defining the values for some important other projectile variables.
  - If variables have not been set after this change then evaluate (~M-:~) the following function ~(hack-dir-local-variables)~.
- ~C-c p s r~ - Allows for use of the ~ripgrep~ command across the current reopository. Useful along with ~C-c C-o~ to pop out the results from the minibuffer into another buffer.
Note that the emacs built-in local dir creation can also be used and is more flexible.

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-project.el

  (straight-use-package 'projectile)
  (require 'projectile)
  (with-eval-after-load 'projectile
    (diminish 'projectile-mode)
    (add-hook 'lsp-mode-hook #'projectile-mode)
    (define-key projectile-mode-map (kbd "C-c p") #'projectile-command-map)
    (when (file-directory-p "~/Projects")
      (customize-set-variable 'projectile-project-search-path '("~/Projects")))
    (customize-set-variable 'projectile-switch-project-action #'projectile-dired))

#+end_src

*Guix Packages*

#+begin_src scheme :noweb-ref packages :noweb-sep ""

  ;; "emacs-projectile" ;; old version 2.5.0

#+end_src

*** Package | magit

Allows for git commands to be applied to the current repository using the command ~C-x g~ which invokes a ~git status~ command with some additional information. Typing ~?~ invokes a list of possible commands, typing ~?~ again invokes the help function for the different commands and typing ~?~ a third time invokes the manual for the package.

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-project.el

  (straight-use-package 'magit)
  (unless (fboundp 'magit-status)
    (autoload #'magit-status "magit" nil t))
  (unless (fboundp 'magit-get-current-branch)
    (autoload #'magit-get-current-branch "magit" nil t))
  (with-eval-after-load 'magit
    (customize-set-variable 'magit-display-buffer-function #'magit-display-buffer-same-window-except-diff-v1))

#+end_src

*Guix Packages*

#+begin_src scheme :noweb-ref packages :noweb-sep ""

  ;; "emacs-magit"

#+end_src

