.emacs.d/Emacs.org
*** Package | git-gutter

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-project.el

  (straight-use-package 'git-gutter)
  (require 'git-gutter)
  (unless (fboundp 'git-gutter-mode)
    (autoload #'git-gutter-mode "git-gutter" nil t))
  (with-eval-after-load 'git-gutter
    (dolist (mode '(text-mode-hook
                    prog-mode-hook))
      (add-hook mode #'git-gutter-mode))
    (diminish 'git-gutter-mode)
    (set-face-foreground 'git-gutter:added "LightGreen")
    (set-face-foreground 'git-gutter:modified "LightGoldenrod")
    (set-face-foreground 'git-gutter:deleted "LightCoral"))

#+end_src

*Guix Packages*

#+begin_src scheme :noweb-ref packages :noweb-sep ""

  ;; "emacs-git-gutter"
  ;; "emacs-git-gutter-fringe"

#+end_src

*** Package | forge

Adds git forges to magit.
Steps to get working:
- Run ~forge-pull~ at the current git repo

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-project.el

  (straight-use-package 'forge)
  (with-eval-after-load 'magit
    (require 'forge))

#+end_src

*Guix Packages*

#+begin_src scheme :noweb-ref packages :noweb-sep ""

  ;; "emacs-forge"

#+end_src

*** Project management and version control package

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-project.el

  (provide 'pg-project)

#+end_src

** IDE Functionalities 

*** Package | lsp-mode

Language Server Protocol for basic IDE functionalities. See [[https://emacs-lsp.github.io/lsp-mode/page/languages/][here]] for how to setup for different languages.
The ~lsp-ui-doc-focus-frame~ command allows to access the documentation frame of the pop-up.

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-programming.el

  (defun pg/lsp-mode-setup ()
    "Displays structure of cursor position for all buffers."
    (setq lsp-headerline-breadcrumb-segments '(path-up-to-project file symbols))
    (lsp-lens-mode)
    (lsp-headerline-breadcrumb-mode))

  (straight-use-package 'lsp-mode)
  (unless (fboundp 'lsp)
    (autoload #'lsp "lsp-mode" nil t))
  (unless (fboundp 'lsp-deferred)
    (autoload #'lsp-deferred "lsp-mode" nil t))
  (with-eval-after-load 'lsp-mode
    (add-hook 'lsp-mode-hook #'pg/lsp-mode-setup)
    (require 'lsp-completion)
    (lsp-enable-which-key-integration t)
    (customize-set-variable 'lsp-completion-provider :none)
    (customize-set-variable 'lsp-keymap-prefix "C-c l"))

#+end_src

*Guix Packages*

#+begin_src scheme :noweb-ref packages :noweb-sep ""

  ;; "emacs-lsp-mode"

#+end_src

*** Package | lsp-ui

Displays useful doc on hover.

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-programming.el

  (straight-use-package 'lsp-ui)
  (with-eval-after-load 'lsp-mode
    (require 'lsp-ui)
    (with-eval-after-load 'lsp-ui
      (add-hook 'lsp-mode-hook #'lsp-ui-mode)
      (customize-set-variable 'lsp-ui-doc-position 'bottom)
      (customize-set-variable 'lsp-ui-doc-show-with-cursor t)
      (customize-set-variable 'lsp-ui-doc-include-signature t)))

#+end_src

*Guix Packages*

#+begin_src scheme :noweb-ref packages :noweb-sep ""

  ;; "emacs-lsp-ui"

#+end_src

*** Package | lsp-treemacs

Tree views in emacs.

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-programming.el

  (straight-use-package 'lsp-treemacs)
  (with-eval-after-load 'lsp-mode
    (require 'lsp-treemacs))

#+end_src

*Guix Packages*

#+begin_src scheme :noweb-ref packages :noweb-sep ""

  ;; "emacs-lsp-treemacs"

#+end_src

*** Package | company

For auto-completions while coding.

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-programming.el

  (defvar company-mode/enable-yas t
    "Enable yasnippet for all backends.")

  (defun company-mode/backend-with-yas (backend)
    "Configures company backend with yasnippet for autocomplete candidates."
    (if (or (not company-mode/enable-yas) (and (listp backend) (member 'company-yasnippet backend)))
        backend
      (append (if (consp backend) backend (list backend))
              '(:with company-yasnippet))))

  (straight-use-package 'company)
  (with-eval-after-load 'lsp-mode
    (require 'company (expand-file-name "straight/repos/company-mode/company.el" user-emacs-directory))
    (with-eval-after-load 'company
      (add-hook 'prog-mode-hook #'company-mode)
      (define-key company-active-map "<tab>" #'company-complete-selection)
      (define-key lsp-mode-map "<tab>" #'company-indent-or-complete-common)
      (customize-set-variable 'company-minimum-prefix-length 1)
      (customize-set-variable 'company-idle-delay 0.0)
      (customize-set-variable 'company-tooltip-minimum-width 40)
      (customize-set-variable 'company-tooltip-maximum-width 60)
      (customize-set-variable 'company-backends (mapcar #'company-mode/backend-with-yas company-backends))))

#+end_src

*Guix Packages*

#+begin_src scheme :noweb-ref packages :noweb-sep ""

  ;; "emacs-company"

#+end_src

*** Package | company-box

Includes icons for company mode suggestions.

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-programming.el

  (straight-use-package 'company-box)
  (with-eval-after-load 'company
    (require 'company-box (expand-file-name "straight/repos/company-box/company-box.el" user-emacs-directory))
    (with-eval-after-load 'company-box
      (add-hook 'company-mode-hook #'company-box-mode)))

#+end_src

*Guix Packages*

#+begin_src scheme :noweb-ref packages :noweb-sep ""

  ;; "emacs-company-box"

#+end_src

*** Package | company-prescient

Remembers autocomplete selections.

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-programming.el

  (straight-use-package 'company-prescient)
  (with-eval-after-load 'company
    (with-eval-after-load 'prescient
      (require 'company-prescient)
      (with-eval-after-load 'company-prescient
        (company-prescient-mode 1))))

#+end_src

*** Package | flycheck

Syntax checking.

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-programming.el

  (straight-use-package 'flycheck)
  (with-eval-after-load 'lsp-mode
    (require 'flycheck)
    (with-eval-after-load 'flycheck
      (add-hook 'lsp-mode-hook #'flycheck-mode)))

#+end_src

*Guix Packages*

#+begin_src scheme :noweb-ref packages :noweb-sep ""

  ;; "emacs-flycheck"

#+end_src

*** Package | dap-mode

Debugger Adaptor Protocol for IDE debugging commands. See [[https://emacs-lsp.github.io/dap-mode/page/configuration/][here]] for how to setup for different languages.

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-programming.el

  (straight-use-package 'dap-mode)
  (with-eval-after-load 'lsp-mode
    (require 'dap-mode)
    (with-eval-after-load 'dap-mode
      (customize-set-variable 'dap-mode 1)
      (customize-set-variable 'dap-ui-mode 1)
      (customize-set-variable 'dap-ui-controls-mode 1)))

#+end_src

*Guix Packages*

#+begin_src scheme :noweb-ref packages :noweb-sep ""

  ;; "emacs-dap-mode"

#+end_src

*** Package | plantuml-mode

Allows writing textual descriptions for creating uml diagrams

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-programming.el

  (straight-use-package 'plantuml-mode)
  (require 'plantuml-mode)
  (with-eval-after-load 'plantuml-mode
    (customize-set-variable 'plantuml-indent-level 4)
    (customize-set-variable 'plantuml-jar-path "~/bin/plantuml.jar")
    (customize-set-variable 'plantuml-default-exec-mode 'jar))

#+end_src

*Guix Packages*

#+begin_src scheme :noweb-ref packages :noweb-sep ""

  ;; "emacs-plantuml-mode"

#+end_src

*** Package | comment-dwin-2

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-programming.el

  (straight-use-package 'comment-dwim-2)
  (unless (fboundp 'comment-dwim-2)
    (autoload #'comment-dwim-2 "comment-dwim-2" nil t))
  (unless (fboundp 'org-comment-dwim-2)
    (autoload #'org-comment-dwim-2 "comment-dwim-2" nil t))
  (require 'comment-dwim-2)
  (with-eval-after-load 'comment-dwim-2
    (global-set-key (kbd "M-/") #'comment-dwim-2)
    (define-key org-mode-map (kbd "M-/") #'org-comment-dwim-2))

#+end_src

*** Package | yasnippet

Allows for code snippets for different languages.

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-programming.el

  (straight-use-package 'yasnippet)
  (require 'yasnippet)
  (with-eval-after-load 'yasnippet
    (diminish 'yas-minor-mode)
    (add-hook 'prog-mode-hook #'yas-minor-mode)
    (add-hook 'yas-minor-mode-hook #'(lambda () (yas-activate-extra-mode 'fundamental-mode)))
    (yas-global-mode 1))

#+end_src

*Guix Packages*

#+begin_src scheme :noweb-ref packages :noweb-sep ""

  ;; "emacs-yasnippet"

#+end_src

*** Package | yasnippet-snippets

Collection of code snippets for yasnippet.

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-programming.el

  (straight-use-package 'yasnippet-snippets)
  (with-eval-after-load 'yasnippet
    (require 'yasnippet-snippets))

#+end_src

*Guix Packages*

#+begin_src scheme :noweb-ref packages :noweb-sep ""

  ;; "emacs-yasnippet-snippets"

#+end_src

*** IDE functionalities package

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-programming.el

  (provide 'pg-programming)

#+end_src

*** Languages

Some general tools for programming:

*Guix Packages*

#+begin_src scheme :tangle ~/.config/guix/manifests/build-tools.scm

  (specifications->manifest
   '("meson"
     "ninja"
     "autoconf"
     "automake"
     "libtool"
     "gmime"
     "xapian"
     "docker"
     ;; "gtk+"
     ;; "gtk+:bin"
     ;; "webkitgtk"
     ;; "guile"
     "pkg-config"
     "glibc"
     "glib"
     "glib:bin"
     ;; "check"
     "make"
     "cmake"))

#+end_src

**** Alloy

***** Package | alloy-mode

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-programming-alloy.el

  ;; (straight-use-package 'alloy-mode)
  ;; (require 'alloy-mode)
  ;; (with-eval-after-load 'alloy-mode
  ;;   (add-hook 'alloy-mode-hook #'(lambda () (setq indent-tabs-mode nil)))
  ;;   (customize-set-variable 'alloy-basic-offset 4))

#+end_src

***** Alloy package

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-programming-alloy.el

  (provide 'pg-programming-alloy)

#+end_src

**** C/C++/Objective-C

***** Package | cc-mode

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-programming-cc.el

  (require 'cc-mode)
  (with-eval-after-load 'cc-mode
    (dolist (mode '(c-mode
                    c++-mode
                    objc-mode))
     (add-hook mode #'lsp-deferred))
    (customize-set-variable 'company-clang-executable (expand-file-name "~/.guix-extra-profiles/cc/cc/bin/clang"))
    (require 'cc-vars)
    (with-eval-after-load 'cc-vars
      (customize-set-variable 'c-basic-offset 4)))

#+end_src

*Guix Packages*

#+begin_src scheme :tangle ~/.config/guix/manifests/cc.scm

  (specifications->manifest
   '("gcc-toolchain@10.3.0"
     "texinfo"
     "llvm"
     "clang"
     "ccls"
     "lld"
     "file"
     "elfutils"
     "go"))

#+end_src

***** Package | company-c-headers

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-programming-cc.el

  (straight-use-package 'company-c-headers)
  (with-eval-after-load 'cc-mode
    (with-eval-after-load 'company
      (require 'company-c-headers)
      (with-eval-after-load 'company-c-headers
        (add-to-list 'company-backends '(company-c-headers :with company-yasnippet)))))

#+end_src

***** Package | ccls

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-programming-cc.el

  (straight-use-package 'ccls)
  (with-eval-after-load 'cc-mode
    (with-eval-after-load 'lsp-mode
      (require 'ccls)))

#+end_src

*Guix Packages*

#+begin_src scheme :noweb-ref packages :noweb-sep ""

  ;; "emacs-ccls"

#+end_src

***** C languages package

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-programming-cc.el

  (provide 'pg-programming-cc)

#+end_src

**** Common Lisp

