.emacs.d/Emacs.org
***** Package | typescript-mode

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-programming-typescript.el

  (straight-use-package 'typescript-mode)
  (with-eval-after-load 'lsp
    (require 'typescript-mode)
    (with-eval-after-load 'typescript-mode
      (add-hook 'typescript-mode-hook #'lsp-deferred)
      (add-to-list 'auto-mode-alist '("\\.ts\\'" . typescript-mode))
      (require 'dap-node)
      (with-eval-after-load 'dap-node
        (dap-node-setup))))

#+end_src

*Guix Packages*

#+begin_src scheme :noweb-ref packages :noweb-sep ""

  ;; "emacs-typescript-mode"

#+end_src

***** Typescript package

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-programming-typescript.el

  (provide 'pg-programming-typescript)

#+end_src

**** VHDL

***** HOLD Package | vhdl-tools

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-programming-vhdl.el

  (flycheck-define-checker vhdl-tool
    "A VHDL syntax checker, type checker and linter using VHDL-Tool."
    :command ("vhdl-tool" "client" "lint" "--compact" "--stdin" "-f" source)
    :standard-input t
    :modes (vhdl-mode)
    :error-patterns
    ((warning line-start (file-name) ":" line ":" column ":w:" (message) line-end)
     (error line-start (file-name) ":" line ":" column ":e:" (message) line-end)))

  (straight-use-package 'vhdl-tools)
  (require 'vhdl-tools)
  (with-eval-after-load 'vhdl-tools
    (add-hook 'vhdl-mode-hook #'lsp-deferred)
    (add-to-list 'flycheck-checkers 'vhdl-tool)
    (customize-set-variable 'lsp-vhdl-server-path "~/.emacs.d/lsp-servers/vhdl-tool"))

#+end_src

***** VHDL package

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-programming-vhdl.el

  (provide 'pg-programming-vhdl)

#+end_src

**** YAML

***** Package | yaml-mode

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-programming-yaml.el

  (straight-use-package 'yaml-mode)
  (require 'yaml-mode)

#+end_src

*Guix Packages*

#+begin_src scheme :noweb-ref packages :noweb-sep ""

  ;; "emacs-yaml-mode"

#+end_src

***** YAML package

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-programming-yaml.el

  (provide 'pg-programming-yaml)

#+end_src

** Notification

*** Package | alert

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-notification.el

  (straight-use-package 'alert)
  (require 'alert)
  (with-eval-after-load 'alert
    (customize-set-variable 'alert-default-style 'notifications))

#+end_src

*Guix Packages*

#+begin_src scheme :noweb-ref packages :noweb-sep ""

  ;; "emacs-alert"

#+end_src

*** Notification package

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-notification.el

  (provide 'pg-notification)

#+end_src

** Org Mode

*** Package | org

Org mode package for writing structured documents and more. Here are some useful things to know about org files.
- ~#+title: Title~ - Sets the title of a document.
- ~M-left~ / ~M-right~ - Promotes/Demotes position of headers and bullet points.
- ~M-up~ / ~M-down~ - Moves the line above or below its current position, respecting the rank.
- ~S-right~ / ~S-left~ - Cycles through different states of headers and bullet points.
- ~M-RET~ - Adds another entry below the current header/bullet point of the same rank. 
- ~C-RET~ - Adds another entry after the current section occupied by the current header of the same rank.
  
#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-org.el

  (defun org-screenshot ()
    "Take a screenshot into a time stamped unique-named file in the `img'
    directory with respect to the org-buffer's location and insert a link to
    this file."
    (interactive)
    (setq imgpath (concat (let ((abspath (shell-command-to-string (concat "dirname " buffer-file-name))))
			    (with-temp-buffer
			      (call-process "echo" nil t nil "-n" abspath)
			      (delete-char -1)  ;; delete trailing \n
			      (buffer-string)))
			  "/img/"))
    (if (not (f-dir-p imgpath))
	(make-directory imgpath))
    (setq filename
	  (concat
	   (make-temp-name
	    (concat imgpath
		    (let ((bname (shell-command-to-string (concat "basename -s .org " buffer-file-name))))
		      (with-temp-buffer
			(call-process "echo" nil t nil "-n" bname)
			(delete-char -1)  ;; delete trailing \n
			(buffer-string)))
		    "_"
		    (format-time-string "%Y%m%d_%H%M%S_"))) ".png"))
    (call-process "import" nil nil nil filename)
    (insert (concat "[[" filename "]]"))
    (org-display-inline-images))

  (defun org-csv-to-table (beg end)
    "Insert a file into the current buffer at point, and convert it to an org
    table."
    (interactive (list (mark) (point)))
    (org-table-convert-region beg end ","))

  (defun pg/org-mode-setup ()
    "Define some behaviours for the major org-mode."
    (org-indent-mode)
    (variable-pitch-mode 1)
    (auto-fill-mode 0)
    (visual-line-mode 1)
    (diminish 'org-indent-mode)
    (setq evil-auto-indent nil))

  (straight-use-package 'org)
  (require 'org)
  (with-eval-after-load 'org
    (set-face-attribute 'org-ellipsis nil :underline nil)
    (add-hook 'org-mode-hook #'pg/org-mode-setup)
    (customize-set-variable 'org-ellipsis " ")
    (customize-set-variable 'org-hide-emphasis-markers t)
    (customize-set-variable 'org-agenda-start-with-log-mode t)
    (customize-set-variable 'org-log-done 'time)
    (customize-set-variable 'org-log-into-drawer t)
    (customize-set-variable 'org-deadline-warning-days 7)
    (customize-set-variable 'org-todo-keywords '((sequence "TODO(t)" "ACTIVE(a)" "REVIEW(v)" "WAIT(w)" "HOLD(h)" "|" "COMPLETED(c)" "CANC(k)")))
    (customize-set-variable 'org-agenda-exporter-settings '((ps-left-header
							     (list 'org-agenda-write-buffer-name))
							    (ps-right-header
							     (list "/pagenumberstring load"
								   (lambda nil
								     (format-time-string "%d/%m/%Y"))))
							    (ps-font-size
							     '(12 . 11))
							    (ps-top-margin 55)
							    (ps-left-margin 35)
							    (ps-right-margin 30)))
    (unless pg/is-termux
      (customize-set-variable 'org-agenda-files '("~/Documents/Org/Agenda/"))
      (customize-set-variable 'org-link-frame-setup '((vm . vm-visit-folder-other-frame)
						      (vm-imap . vm-visit-imap-folder-other-frame)
						      (gnus . org-gnus-no-new-news)
						      (file . find-file)
						      (wl . wl-other-frame)))
      (customize-set-variable 'org-agenda-custom-commands
			      '(("d" "Dashboard"
				 ((agenda ""
					  ((org-deadline-warning-days 7)))
				  (todo "TODO"
					((org-agenda-overriding-header "Tasks")))
				  (tags-todo "agenda/ACTIVE"
					     ((org-agenda-overriding-header "Active Tasks")))))
				("Z" "TODOs"
				 ((todo "TODO"
					((org-agenda-overriding-header "Todos")))))

				("m" "Misc" tags-todo "other")

				("s" "Schedule" agenda ""
				 ((org-agenda-files
				   '("~/Documents/Org/Agenda/Schedule-S5-summer.org")))
				 ("~/Documents/Schedule-S5-summer.pdf"))

				("w" "Work Status"
				 ((todo "WAIT"
					((org-agenda-overriding-header "Waiting")
					 (org-agenda-files org-agenda-files)))
				  (todo "REVIEW"
					((org-agenda-overriding-header "In Review")
					 (org-agenda-files org-agenda-files)))
				  (todo "HOLD"
					((org-agenda-overriding-header "On Hold")
					 (org-agenda-todo-list-sublevels nil)
					 (org-agenda-files org-agenda-files)))
				  (todo "ACTIVE"
					((org-agenda-overriding-header "Active")
					 (org-agenda-files org-agenda-files)))
				  (todo "COMPLETED"
					((org-agenda-overriding-header "Completed")
					 (org-agenda-files org-agenda-files)))
				  (todo "CANC"
					((org-agenda-overriding-header "Cancelled")
					 (org-agenda-files org-agenda-files)))))))
      (customize-set-variable 'org-capture-templates
			      `(("t" "Tasks / Projects")


				("tt" "Task" entry
				 (file+olp "~/Documents/Org/Agenda/Tasks.org" "Active")
				 "* TODO %?\n  DEADLINE: %U\n  %a\n  %i" :empty-lines 1)

				("j" "Meetings")
				("jm" "Meeting" entry
				 (file+olp "~/Documents/Org/Agenda/Tasks.org" "Waiting")
				 "* TODO %? \n SCHEDULED: %U\n" :empty-lines 1)

				("m" "Email Workflow")
				("mr" "Follow Up" entry
				 (file+olp "~/Documents/Org/Agenda/Mail.org" "Follow up")
				 "* TODO %a\nDEADLINE: %U%?\n %i" :empty-lines 1)))
      (customize-set-variable 'org-format-latex-options
			      (plist-put org-format-latex-options :scale 1.5))
      (with-eval-after-load 'plant-uml-mode
	(customize-set-variable 'org-plantuml-jar-path "~/bin/plantuml.jar"))))

#+end_src

*Guix Packages*

#+begin_src scheme :noweb-ref packages :noweb-sep ""

  ;; "emacs-org"

#+end_src

*** Package | org-appear

Toggles visibility of emphasis markers.

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-org.el

  (straight-use-package 'org-appear)
  (with-eval-after-load 'org
    (require 'org-appear)
    (with-eval-after-load 'org-appear
      (add-hook 'org-mode-hook #'org-appear-mode)))

#+end_src

*Guix Packages*

#+begin_src scheme :noweb-ref packages :noweb-sep ""

  ;; "emacs-org-appear"

#+end_src

*** Package | org-bullets

Customizes the heading bullets.

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-org.el

  (straight-use-package 'org-bullets)
  (with-eval-after-load 'org
    (require 'org-bullets)
    (with-eval-after-load 'org-bullets
      (add-hook 'org-mode-hook #'org-bullets-mode)
      (customize-set-variable 'org-bullets-bullet-list '("" "" "" "" "" "" ""))))

#+end_src

*Guix Packages*

#+begin_src scheme :noweb-ref packages :noweb-sep ""

  ;; "emacs-org-bullets"

#+end_src

*** Package | org-tree-slide

Allows for creation of slideshow presentations in emacs with org mode. The ~org-beamer-export-to-pdf~ command can be used to export the presentation as a pdf file - it requires ~pdflatex~. More detail [[https://orgmode.org/worg/exporters/beamer/tutorial.html][here]].

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-org.el

  (defun pg/presentation-setup ()
    "Setup before starting org presentation."
    (org-display-inline-images)
    (variable-pitch-mode 1)
    (setq-local doom-modeline-minor-modes t
                org-format-latex-options (plist-put org-format-latex-options :scale 2.5)
                face-remapping-alist '((default (:height 1.25) default)
                                       (header-line (:height 4.5) variable-pitch)
                                       (variable-pitch (:height 1.25) variable-pitch)
                                       (org-table (:height 1.5) org-table)
                                       (org-verbatim (:height 1.5) org-verbatim)
                                       (org-code (:height 1.5) org-code)
                                       (org-block (:height 1.5) org-block))))

  (defun pg/presentation-end ()
    "Cleanup after ending org presentation."
    (variable-pitch-mode 0)
    (org-latex-preview)
    (setq-local doom-modeline-minor-modes nil
                org-format-latex-options (plist-put org-format-latex-options :scale 1.5)
                face-remapping-alist '((default variable-pitch default))))

  (straight-use-package 'org-tree-slide)
  (with-eval-after-load 'org
    (require 'org-tree-slide)
    (with-eval-after-load 'org-tree-slide
      (dolist (mode '(org-tree-slide-before-move-next-hook
                      org-tree-slide-before-move-previous-hook))
        (add-hook mode #'org-latex-preview))
      (add-hook 'org-tree-slide-play-hook #'pg/presentation-setup)
      (add-hook 'org-tree-slide-stop-hook #'pg/presentation-end)
      (customize-set-variable 'org-tree-slide-activate-message "Presentation started")
      (customize-set-variable 'org-tree-slide-deactivate-message "Presentation ended")
      (customize-set-variable 'org-tree-slide-breadcrumbs " > ")
      (customize-set-variable 'org-tree-slide-header t)
      (customize-set-variable 'org-image-actual-width nil)))

#+end_src

*Guix Packages*

#+begin_src scheme :noweb-ref packages :noweb-sep ""

  ;; "emacs-org-tree-slide"

#+end_src

*** Package | ox-reveal

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-org.el

  (straight-use-package 'ox-reveal)
  (with-eval-after-load 'org
    (require 'ox-reveal)
    (with-eval-after-load 'ox-reveal
      (customize-set-variable 'org-reveal-root "https://cdn.jsdelivr.net/npm/reveal.js")
      (customize-set-variable 'org-reveal-hlevel 1)
      (customize-set-variable 'org-export-headline-levels 6)
      (customize-set-variable 'org-reveal-theme "league")))

#+end_src

*Guix Packages*

#+begin_src scheme :noweb-ref packages :noweb-sep ""

  ;; "emacs-ox-reveal"

#+end_src

*** Package | org-notify

Handles notifications of scheduled tasks.

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-org.el

  (straight-use-package 'org-notify)
  (with-eval-after-load 'org
    (require 'org-notify)
    (with-eval-after-load 'org-notify
      (org-notify-start)
      (setq org-notify-map nil)
      (org-notify-add 'default '(:time "1w" :actions -notify/window :period "1h" :duration 5))
      (org-notify-add 'meeting '(:time "1w" :actions -email :period "1d"))))

  ;; (org-notify-add 'appt
  ;;                 '(:time "-1s" :period "20s" :duration 10 :actions (-message -ding))
  ;;                 '(:time "15m" :period "2m" :duration 100 :actions -notify)
  ;;                 '(:time "2h" :period "5m" :actions -message)
  ;;                 '(:time "3d" :actions -email))

#+end_src

*** Package | org-msg

Allows for markup language when composing email

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-org.el

  (straight-use-package 'org-msg)
  (with-eval-after-load 'org
    (with-eval-after-load 'mu4e
      (require 'org-msg)
      (with-eval-after-load 'org-msg
        (customize-set-variable 'org-msg-options "html-postamble:nil toc:nil author:nil num:nil \\n:t")
        (customize-set-variable 'org-msg-startup "indent inlineimages hidestars")
        (customize-set-variable 'org-msg-greeting-fmt "\nBonjour/Hi %s,\n\n")
        (customize-set-variable 'org-msg-greeting-name-limit 3)
        (customize-set-variable 'org-message-convert-citation t)
        (customize-set-variable 'org-msg-signature (concat "\n\nCordialement/Regards,\n\n*--*\n" mu4e-compose-signature))
        (customize-set-variable 'org-msg-recipient-names nil)
        (org-msg-mode))))

#+end_src

*Guix Packages*

#+begin_src scheme :noweb-ref packages :noweb-sep ""

  ;; "emacs-org-msg"

#+end_src

