.emacs.d/Emacs.org
*** Package | org-roam

Helps with note-taking strategies.

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-org.el

  (straight-use-package 'org-roam)
  (unless pg/is-termux
    (with-eval-after-load 'org
      (require 'org-roam)
      (with-eval-after-load 'org-roam
        (customize-set-variable 'org-roam-node-display-template (concat "${title:*} " (propertize "${tags:10}" 'face 'org-tag)))
        (customize-set-variable 'org-roam-directory "~/Documents/Notes")
        (customize-set-variable 'org-roam-capture-templates
                                '(("d" "default" plain
                                   "%?"
                                   :if-new (file+head "%<%Y%m%d%H%M%S>-${slug}.org"
                                                      "#+title: ${title}\n#+STARTUP: latexpreview inlineimages\n#+date: %U\n")
                                   :unnarrowed t)
                                  ("e" "economy" plain
                                   "%?"
                                   :if-new (file+head "ECN-1000/notes/%<%Y%m%d%H%M%S>-${slug}.org"
                                                      "#+title: ecn1000-${title}\n#+STARTUP: latexpreview inlineimages\n#+date: %U\n")
                                   :unnarrowed t)))
        (org-roam-setup))))

#+end_src

*Guix Packages*

#+begin_src scheme :noweb-ref packages :noweb-sep ""

  ;; "emacs-org-roam"

#+end_src

*** Package | org-fragtog

Allows display of latex fragments in org files.

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-org.el

  (straight-use-package 'org-fragtog)
  (with-eval-after-load 'org
    (require 'org-fragtog)
    (with-eval-after-load 'org-fragtog
      (add-hook 'org-mode-hook #'org-fragtog-mode)))

#+end_src

*Guix Packages*

#+begin_src scheme :noweb-ref packages :noweb-sep ""

  ;; "emacs-org-fragtog"

#+end_src

*** UI customization

Various improvements to the UI look in org files.

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-org.el

  (font-lock-add-keywords 'org-mode ; Replace '-' with bullets
                          '(("^ *\\([-]\\) "
                             (0 (prog1 () (compose-region
                                           (match-beginning 1) (match-end 1) ""))))))

  (require 'org-indent) ; Changes some org structures to fixed pitch
  (set-face-attribute 'org-block nil :foreground nil :background "gray5" :inherit 'fixed-pitch)
  (set-face-attribute 'org-code nil :foreground "orange" :inherit 'fixed-pitch)
  (set-face-attribute 'org-verbatim nil :foreground "green" :inherit 'fixed-pitch)
  (set-face-attribute 'org-table nil :foreground "thistle3" :inherit '(shadow fixed-pitch))
  (set-face-attribute 'org-indent nil :inherit '(org-hide fixed-pitch))
  (set-face-attribute 'org-special-keyword nil :inherit '(font-lock-comment-face fixed-pitch))
  (set-face-attribute 'org-meta-line nil :inherit '(font-lock-comment-face fixed-pitch))
  (set-face-attribute 'org-checkbox nil :inherit 'fixed-pitch)

  (dolist (face '((org-level-1 . 1.2) ; Sets font for variable-pitch text
                  (org-level-2 . 1.1)
                  (org-level-3 . 1.05)
                  (org-level-4 . 1.0)
                  (org-level-5 . 1.1)
                  (org-level-6 . 1.1)
                  (org-level-7 . 1.1)
                  (org-level-8 . 1.1)))
    (set-face-attribute (car face) nil :font "Iosevka Aile" :weight 'regular :height (cdr face)))

#+end_src

*** Code blocks

Customizes behaviour of code blocks. Some useful constructs to know:
- ~#+PROPERTY: header-args: emacs-lisp~ - Sets a property to code blocks to have their header args be defined as indicated.
- ~#+NAME: code-block-name~ - Gives a name to a code block.
- ~:noweb yes/no~ - Used for source blocks to allow them to use values outputted by other source blocks.
- ~:mkdir p yes/no~ - Allows code blocks to create directories.

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-org.el

  (with-eval-after-load 'org ; Defer the body code until org is loaded
    (org-babel-do-load-languages ; Loads languages to be executed by org-babel
     'org-babel-load-languages '((emacs-lisp . t)
                                 (java . t)
                                 (shell . t)
                                 (plantuml . t)
                                 ;; (jupyter . t)
                                 (python . t)))

    (setq org-confirm-babel-evaluate nil)

    (require 'org-tempo) ; Allows defined snippets to expand into appropriate code blocks
    (add-to-list 'org-structure-template-alist '("sh" . "src shell"))
    (add-to-list 'org-structure-template-alist '("java" . "src java"))
    (add-to-list 'org-structure-template-alist '("als" . "src alloy"))
    (add-to-list 'org-structure-template-alist '("puml" . "src plantuml"))
    (add-to-list 'org-structure-template-alist '("vhd" . "src vhdl"))
    (add-to-list 'org-structure-template-alist '("asm" . "src mips"))
    (add-to-list 'org-structure-template-alist '("cc" . "src c"))
    (add-to-list 'org-structure-template-alist '("el" . "src emacs-lisp"))
    (add-to-list 'org-structure-template-alist '("py" . "src python"))
    (add-to-list 'org-structure-template-alist '("sql" . "src sql"))

    (add-to-list 'org-src-lang-modes '("als" . alloy))
    (add-to-list 'org-src-lang-modes '("plantuml" . plantuml)))

#+end_src

*** Auto-tangling configuration files

Allows automatic tangling on save of these configuration files.

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-org.el

  (defun pg/org-babel-tangle-config ()
    "Automatic tangle of emacs config file."
    (when (eq major-mode #'org-mode)
      (let ((org-confirm-babel-evaluate nil))
        (org-babel-tangle))))

  (add-hook 'org-mode-hook #'(lambda ()
                               (add-hook 'after-save-hook #'pg/org-babel-tangle-config)))

#+end_src
 
*** Pomodoro timer

Custom pomodoro timer

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-org.el

  (defun pg/timer-setup ()
    "Sets up some parameters for the timer"
    (setq org-clock-sound "~/Misc/ding.wav"))

  (defun pg/start-timer ()
    "Begins Pomodoro timer with study timer"
    (interactive)
    (pg/timer-setup)
    (pg/study-timer))

  (defun pg/start-with-break-timer ()
    "Begin Pomodoro timer with break timer"
    (interactive)
    (pg/timer-setup)
    (pg/break-timer))

  (defun pg/stop-timer ()
    "Stops the timer"
    (interactive)
    (setq org-clock-sound nil)
    (remove-hook 'org-timer-done-hook #'pg/study-timer)
    (remove-hook 'org-timer-done-hook #'pg/break-timer)
    (org-timer-stop))

  (defun pg/study-timer ()
    "Study timer for 1 hour"
    (add-hook 'org-timer-done-hook #'pg/break-timer)
    (remove-hook 'org-timer-done-hook #'pg/study-timer)
    (setq org-timer-default-timer "1:00:00")
    (setq current-prefix-arg '(4)) ; Universal argument
    (call-interactively #'org-timer-set-timer))

  (defun pg/break-timer ()
    "Break timer for 30 minutes"
    (add-hook 'org-timer-done-hook #'pg/study-timer)
    (remove-hook 'org-timer-done-hook #'pg/break-timer)
    (setq org-timer-default-timer "30:00")
    (setq current-prefix-arg '(4)) ; Universal argument
    (call-interactively #'org-timer-set-timer))

#+end_src

*** Org package

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-org.el

  (provide 'pg-org)

#+end_src

** Viewers

*** Package | doc-view

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-viewers.el

  (require 'doc-view)
  (with-eval-after-load 'doc-view
    (add-to-list 'auto-mode-alist '("\\.djvu\\'" . doc-view-mode)))

#+end_src

*** Package | pdf-tools

Allows for viewing of pdfs.

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-viewers.el

  (straight-use-package 'pdf-tools)
  (require 'pdf-tools)
  (with-eval-after-load 'pdf-tools
    (add-to-list 'auto-mode-alist '("\\.pdf\\'" . pdf-view-mode)))

#+end_src

*Guix Packages*

#+begin_src scheme :noweb-ref packages :noweb-sep ""

  ;; "emacs-pdf-tools"

#+end_src

*** Package | djvu

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-viewers.el

  (straight-use-package 'djvu)
  (require 'djvu)

#+end_src

*Guix Packages*

#+begin_src scheme :noweb-ref packages :noweb-sep ""

  ;; "emacs-djvu"

#+end_src

*** Viewers package

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-viewers.el

  (provide 'pg-viewers)

#+end_src

** Bible

*** Package | dtk

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-bible.el

  ;; (straight-use-package 'dtk)
  ;; (with-eval-after-load 'evil-collection
  ;;   (unless (fboundp 'dtk)
  ;;     (autoload #'dtk "dtk" nil t))
  ;;   (with-eval-after-load 'dtk
  ;;     (evil-collection-define-key 'normal 'dtk-mode-map
  ;;       (kbd "C-j") 'dtk-forward-verse
  ;;       (kbd "C-k") 'dtk-backward-verse
  ;;       (kbd "C-f") 'dtk-forward-chapter
  ;;       (kbd "C-b") 'dtk-backward-chapter
  ;;       "q" 'dtk-quit
  ;;       "c" 'dtk-clear-dtk-buffer
  ;;       "s" 'dtk-search)
  ;;     (add-hook 'dtk-mode-hook #'(lambda ()
  ;;                                  (setq-local face-remapping-alist '((default (:height 1.5) variable-pitch)))))
  ;;     (customize-set-variable 'dtk-module "KJV")
  ;;     (customize-set-variable 'dtk-module-category "Biblical Texts")
  ;;     (customize-set-variable 'dtk-word-wrap t)))

#+end_src

*** Bible package

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-bible.el

  (provide 'pg-bible)

#+end_src

** Finances

*** Package | ledger-mode

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-finance.el

  (straight-use-package 'ledger-mode)
  (require 'ledger-mode)
  (with-eval-after-load 'ledger-mode
    (add-to-list 'auto-mode-alist '("\\.dat\\'" . ledger-mode))
    (add-hook 'ledger-mode-hook #'company-mode)
    (customize-set-variable 'ledger-reconcile-default-commodity "CAD")
    (customize-set-variable 'ledger-binary-path "/home/phil-gab99/.guix-extra-profiles/emacs/emacs/bin/ledger")
    (customize-set-variable 'ledger-clear-whole-transaction t))

#+end_src

*Guix Packages*

#+begin_src scheme :noweb-ref packages :noweb-sep ""

  "ledger"
  ;; "emacs-ledger-mode"

#+end_src

*** Finances package

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-finance.el

  (provide 'pg-finance)

#+end_src

** Social

*** Package | slack

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-social.el

  (straight-use-package 'slack)
  (unless (fboundp 'slack-start)
    (autoload #'slack-start "slack" nil t))
  (with-eval-after-load 'slack
    (slack-register-team :name "ift6755"
                         :default t
                         :token (pg/lookup-password :host "ift6755.slack.com" :user "philippe.gabriel.1@umontreal.ca")
                         :cookie (pg/lookup-password :host "ift6755.slack.com" :user "philippe.gabriel.1@umontreal.ca^cookie")
                         :subscribed-channels '((general questions random))
                         :modeline-enabled t)
    (evil-define-key 'normal slack-info-mode-map
      ",u" 'slack-room-update-messages)
    (evil-define-key 'normal slack-mode-map
      ",ra" 'slack-message-add-reaction
      ",rr" 'slack-message-remove-reaction
      ",rs" 'slack-message-show-reaction-users
      ",mm" 'slack-message-write-another-buffer
      ",me" 'slack-message-edit
      ",md" 'slack-message-delete)
    (customize-set-variable 'slack-prefer-current-team t)
    (require 'emojify)
    (with-eval-after-load 'emojify
      (customize-set-variable 'slack-buffer-emojify t)))

#+end_src

*Guix Packages*

#+begin_src scheme :noweb-ref packages :noweb-sep ""

  ;; "emacs-slack" ;; Older commit

#+end_src

*** Package | sx

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-social.el

  (straight-use-package 'sx)
  (unless (fboundp 'sx-search)
    (autoload #'sx-search "sx" nil t))

#+end_src

*Guix Packages*

#+begin_src scheme :noweb-ref packages :noweb-sep ""

  ;; "emacs-sx"

#+end_src

*** Package | telega

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-social.el

  (require 'telega)
  (with-eval-after-load 'telega
    (require 'telega-alert)
    (require 'telega-dashboard)
    (telega 1)
    (customize-set-variable 'telega-alert-mode 1))

#+end_src

*Guix Packages*

#+begin_src scheme :noweb-ref packages :noweb-sep ""

  "emacs-telega"
  "emacs-telega-contrib"

#+end_src

*** Social package

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-social.el

  (provide 'pg-social)

#+end_src

** Weather

