.emacs.d/Emacs.org
*** Package | wttrin

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-weather.el

  (defun pg/wttrin-fetch-raw-string (query)
    "Get the weather information based on your QUERY."
    (let ((url-user-agent "curl"))
      (add-to-list 'url-request-extra-headers wttrin-default-accept-language)
      (with-current-buffer
          (url-retrieve-synchronously
           (concat "http://wttr.in/" query)
           (lambda (status) (switch-to-buffer (current-buffer))))
        (decode-coding-string (buffer-string) 'utf-8))))

  (straight-use-package 'wttrin)
  (unless (fboundp 'wttrin)
    (autoload #'wttrin "wttrin" nil t))
  (with-eval-after-load 'wttrin
    (fset #'wttrin-fetch-raw-string #'pg/wttrin-fetch-raw-string)
    (customize-set-variable 'wttrin-default-cities '("montreal"))
    (customize-set-variable 'wttrin-default-accept-language '("Accept-Language" . "en-US")))

#+end_src

*Guix Packages*

#+begin_src scheme :noweb-ref packages :noweb-sep ""

  ;; "emacs-wttrin"

#+end_src

*** Weather package

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-weather.el

  (provide 'pg-weather)

#+end_src

** Music

*** Package | emms

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-music.el

  (defun pg/start-mpd ()
    "Start MPD, connects to it and syncs the metadata cache."
    (interactive)
    (shell-command "herd start mpd")
    (pg/update-mpd-db)
    (emms-player-mpd-connect)
    (emms-cache-set-from-mpd-all)
    (emms-smart-browse)
    (message "MPD Started!"))

  (defun pg/kill-mpd ()
    "Stops playback and kill the music daemon."
    (interactive)
    (emms-stop)
    (emms-smart-browse)
    (emms-player-mpd-disconnect)
    (shell-command "herd stop mpd")
    (message "MPD Killed!"))

  (defun pg/update-mpd-db ()
    "Updates the MPD database synchronously."
    (interactive)
    (pg/call-mpc nil "update")
    (message "MPD Database Updated!"))

  (defun pg/convert-number-to-relative-string (number)
    "Convert an integer NUMBER to a prefixed string.

        The prefix is either - or +. This is useful for mpc commands
        like volume and seek."
    (let ((number-string (number-to-string number)))
      (if (> number 0)
          (concat "+" number-string)
        number-string)))

  (defun pg/call-mpc (destination mpc-args)
    "Call mpc with `call-process'.

        DESTINATION will be passed to `call-process' and MPC-ARGS will be
        passed to the mpc program."
    (if (not (listp mpc-args))
        (setq mpc-args (list mpc-args)))
    (apply 'call-process "mpc" nil destination nil mpc-args))

  (defun pg/message-current-volume ()
    "Return the current volume."
    (message "%s"
             (with-temp-buffer
               (pg/call-mpc t "volume")
               (delete-char -1)  ;; delete trailing \n
               (buffer-string))))

  (defun pg/emms-volume-amixer-change (amount)
    "Change amixer master volume by AMOUNT."
    (let ((volume-change-string (pg/convert-number-to-relative-string amount)))
      (pg/call-mpc nil (list "volume" volume-change-string)))
    (pg/message-current-volume))

  (straight-use-package 'emms)
  (unless pg/is-termux
    (require 'emms)
    (with-eval-after-load 'emms
      (require 'emms-setup)
      (require 'emms-player-mpd)
      (emms-all)
      (setq emms-info-functions '(emms-info-mpd)
            emms-player-list '(emms-player-mpd))
      (add-hook 'emms-playlist-cleared-hook #'emms-player-mpd-clear)
      (fset #'emms-volume-amixer-change #'pg/emms-volume-amixer-change)

      ;;      (bind-keys :package emms
      ;;		 ("<XF86AudioPrev>" . emms-previous)
      ;;		 ("<XF86AudioNext>" . emms-next)
      ;;		 ("<XF86AudioPlay>" . emms-pause)
      ;;		 ("<XF86AudioStop>" . emms-stop))
      (customize-set-variable 'emms-source-file-default-directory "/home/phil-gab99/Music")
      (customize-set-variable 'emms-player-mpd-music-directory "/home/phil-gab99/Music")
      (customize-set-variable 'emms-seek-seconds 5)
      (customize-set-variable 'emms-volume-change-amount 5)))

#+end_src

*Guix Packages*

#+begin_src scheme :noweb-ref packages :noweb-sep ""

  ;; "emacs-emms"

#+end_src

*** Package | emms-mode-line-cycle

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-music.el

  (straight-use-package 'emms-mode-line-cycle)
  (with-eval-after-load 'emms
    (require 'emms-mode-line-cycle)
    (with-eval-after-load 'emms-mode-line-cycle
      (emms-mode-line 1)
      (emms-playing-time 1)
      (require 'emms-mode-line-icon)
      (customize-set-variable 'emms-mode-line-cycle-use-icon-p t)
      (emms-mode-line-cycle 1)))

#+end_src

*Guix Packages*

#+begin_src scheme :noweb-ref packages :noweb-sep ""

  ;; "emacs-emms-mode-line-cycle"

#+end_src

*** Music package

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-music.el

  (provide 'pg-music)

#+end_src

** Games

*** Package | sudoku

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-games.el

  (straight-use-package 'sudoku)
  (unless (fboundp 'sudoku)
    (autoload #'sudoku "sudoku" nil t))
  (with-eval-after-load 'sudoku
    (customize-set-variable 'sudoku-style 'unicode)
    (customize-set-variable 'sudoku-level 'hard))

#+end_src

*** Package | sokoban

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-games.el

  (straight-use-package 'sokoban)
  (unless (fboundp 'sokoban)
    (autoload #'sokoban "sokoban" nil t))
  (unless (fboundp 'sokoban-goto-level)
    (autoload #'sokoban-goto-level "sokoban" nil t))
  (with-eval-after-load 'sokoban
    (define-key sokoban-mode-map "<normal-state> h" #'sokoban-move-left)
    (define-key sokoban-mode-map "<normal-state> l" #'sokoban-move-right)
    (define-key sokoban-mode-map "<normal-state> k" #'sokoban-move-up)
    (define-key sokoban-mode-map "<normal-state> j" #'sokoban-move-down))

#+end_src

*** Games package

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-games.el

  (provide 'pg-games)

#+end_src

** Keybindings

*** Package | hydra

Allows the creation of keymaps for related commands and the ability to repeat terminal commands. Works in conjunction with the ~general~ package.

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-bindings.el

  (straight-use-package 'hydra)
  (require 'hydra)

  (defhydra hydra-text-scale (:timeout 5)
    "scale text"
    ("j" text-scale-increase "in")
    ("k" text-scale-decrease "out"))

  (defhydra hydra-window-scale (:timeout 5)
    "scale window"
    ("<" evil-window-decrease-width "width dec")
    (">" evil-window-increase-width "width inc")
    ("-" evil-window-decrease-height "height dec")
    ("+" evil-window-increase-height "height inc")
    ("=" balance-windows "balance"))

  (defhydra hydra-x-window-scale (:timeout 5)
    "scale x window"
    ("<" (exwm-layout-shrink-window-horizontally 50) "width dec")
    (">" (exwm-layout-enlarge-window-horizontally 50) "width inc")
    ("-" (exwm-layout-shrink-window 50) "height dec")
    ("+" (exwm-layout-enlarge-window 50) "height inc")
    ("w" exwm-floating-toggle-floating "float toggle")
    ("f" exwm-layout-set-fullscreen "fullscreen"))

  (defhydra hydra-window-move (:timeout 5)
    "move window"
    ("h" windmove-left "left")
    ("l" windmove-right "right")
    ("j" windmove-down "down")
    ("k" windmove-up "up"))

  (defhydra hydra-window-swap (:timeout 5)
    "swap window"
    ("h" windmove-swap-states-left "left")
    ("l" windmove-swap-states-right "right")
    ("j" windmove-swap-states-down "down")
    ("k" windmove-swap-states-up "up"))

  (defhydra hydra-window-change (:timeout 5)
    "change window"
    ("l" next-buffer "right")
    ("h" previous-buffer "left"))

  (defhydra hydra-eyebrowse-switch (:timeout 5)
    "switch workspace"
    ("l" eyebrowse-next-window-config "next")
    ("h" eyebrowse-prev-window-config "prev"))

  (defhydra hydra-perspective-switch (:timeout 5)
    "switch perspective"
    ("l" persp-next "next")
    ("h" persp-prev "prev"))

#+end_src

*Guix Packages*

#+begin_src scheme :noweb-ref packages :noweb-sep ""

  ;; "emacs-hydra"

#+end_src

*** Package | iso-transl

#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/pg-bindings.el

  (require 'iso-transl)
  (with-eval-after-load 'iso-transl ;; Bind compose key in case emacs captures it
    (define-key global-map (kbd "<Multi_key>") iso-transl-ctl-x-8-map))

#+end_src

